app/controllers/moods_controller.rb

SELECT "moods".* FROM "moods"
---
  def get_moods
    @moods = Mood.all

INSERT INTO "songs" ("uri", "mood_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["uri", ""], ["mood_id", 1], ["created_at", 2017-03-15 01:45:48 UTC], ["updated_at", 2017-03-15 01:45:48 UTC]]
---
  def save_mood

    @song = Song.create!(uri: "#{params[:uri]}", mood_id: params[:id])