app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."mood_id" = $1  [["mood_id", 2]]
---
  def get_all_songs
    @songs = Song.where(mood_id: params[:id])